#  Data Cleaning to choose data sets to work with

In [1]:
#loading the necesssary libraries
import pandas as pd
import csv
import sqlite3

# Loading and understanding the data sets

# rt_movie_df

In [192]:
rt_movie_df = pd.read_csv('unzippedData/rt.movie_info.tsv', sep = '\t')
# this is information about the rt_movie_df
rt_movie_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1560 non-null   int64
 1   synopsis      1498 non-null   object
 2   rating        1557 non-null   object
 3   genre         1552 non-null   object
 4   director      1361 non-null   object
 5   writer        1111 non-null   object
 6   theater_date  1201 non-null   object
 7   dvd_date      1201 non-null   object
 8   currency      340 non-null    object
 9   box_office    340 non-null    object
 10  runtime       1530 non-null   object
 11  studio        494 non-null    object
dtypes: int64(1), object(11)
memory usage: 146.4+ KB

In [193]:
rt_movie_df.describe()

                id
count  1560.000000
mean   1007.303846
std     579.164527
min       1.000000
25%     504.750000
50%    1007.500000
75%    1503.250000
max    2000.000000

In [194]:
print("The 'rt_movie_df' has 1560 rows with 12 columns, the column names are: {}".format(rt_movie_df.columns))

The 'rt_movie_df' has 1560 rows with 12 columns, the column names are: Index(['id', 'synopsis', 'rating', 'genre', 'director', 'writer',
       'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime',
       'studio'],
      dtype='object')

In [195]:
#The column names are
rt_movie_df.columns

Index(['id', 'synopsis', 'rating', 'genre', 'director', 'writer',
       'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime',
       'studio'],
      dtype='object')

In [196]:
print("In the 'rt_movie_df', all the columns except 'id' have missing values")

In the 'rt_movie_df', all the columns except 'id' have missing values

In [197]:
rt_movie_df.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [198]:
rt_movie_df.tail()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
1555,1996,Forget terrorists or hijackers -- there's a ha...,R,Action and Adventure|Horror|Mystery and Suspense,NaN,NaN,"Aug 18, 2006","Jan 2, 2007",$,"33,886,034",106 minutes,New Line Cinema
1556,1997,The popular Saturday Night Live sketch was exp...,PG,Comedy|Science Fiction and Fantasy,Steve Barron,Terry Turner|Tom Davis|Dan Aykroyd|Bonnie Turner,"Jul 23, 1993","Apr 17, 2001",NaN,NaN,88 minutes,Paramount Vantage
1557,1998,"Based on a novel by Richard Powell, when the l...",G,Classics|Comedy|Drama|Musical and Performing Arts,Gordon Douglas,NaN,"Jan 1, 1962","May 11, 2004",NaN,NaN,111 minutes,NaN
1558,1999,The Sandlot is a coming-of-age story about a g...,PG,Comedy|Drama|Kids and Family|Sports and Fitness,David Mickey Evans,David Mickey Evans|Robert Gunter,"Apr 1, 1993","Jan 29, 2002",NaN,NaN,101 minutes,NaN
1559,2000,"Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,NaN,Luc Besson,"Sep 27, 2001","Feb 11, 2003",NaN,NaN,94 minutes,Columbia Pictures

In [199]:
rt_movie_df.rating.value_counts() # this shows the value counts for the various ratings of the movies in this data set
print("The ratings are basically general, parental guidance, parental guidance for those below 13 years of age among others")

The ratings are basically general, parental guidance, parental guidance for those below 13 years of age among others

In [200]:
rt_movie_df.isna().sum()

id                 0
synopsis          62
rating             3
genre              8
director         199
writer           449
theater_date     359
dvd_date         359
currency        1220
box_office      1220
runtime           30
studio          1066
dtype: int64

In [201]:
rt_movie_df.dropna(subset = ['synopsis', 'rating', 'genre',
                            ], axis = 0, inplace = True)
# this code removes the missing values in the columns where data cannot be filled

In [202]:
rt_movie_df.drop(['currency', 'box_office', 'studio'], axis = 1, inplace = True)

In [203]:
rt_movie_df.fillna(rt_movie_df['director'].mode()[0], inplace = True)
# filling the missig values of some rows using the mode

In [204]:
rt_movie_df.duplicated().sum() # this data set has no duplicates

0

In [205]:
rt_movie_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1495 entries, 0 to 1559
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1495 non-null   int64
 1   synopsis      1495 non-null   object
 2   rating        1495 non-null   object
 3   genre         1495 non-null   object
 4   director      1495 non-null   object
 5   writer        1495 non-null   object
 6   theater_date  1495 non-null   object
 7   dvd_date      1495 non-null   object
 8   runtime       1495 non-null   object
dtypes: int64(1), object(8)
memory usage: 116.8+ KB

In [210]:
#replacing an inconsistent runtime with the mode
rt_movie_df['runtime_mins'] = rt_movie_df['runtime'].str.replace('Steven Spielberg', rt_movie_df['runtime'].mode()[0])

In [218]:
rt_movie_df['runtime_mins'] = rt_movie_df['runtime_mins'].str.replace('minutes','')
rt_movie_df.runtime_mins.unique()

array(['104 ', '108 ', '116 ', '128 ', '95 ', '82 ', '123 ', '117 ',
       '90 ', '97 ', '106 ', '129 ', '98 ', '127 ', '96 ', '101 ', '114 ',
       '110 ', '65 ', '75 ', '92 ', '91 ', '73 ', '100 ', '99 ', '103 ',
       '112 ', '142 ', '119 ', '122 ', '86 ', '93 ', '111 ', '118 ',
       '89 ', '74 ', '115 ', '107 ', '165 ', '113 ', '186 ', '67 ',
       '102 ', '60 ', '135 ', '109 ', '70 ', '124 ', '105 ', '134 ',
       '80 ', '87 ', '167 ', '77 ', '81 ', '94 ', '188 ', '126 ', '63 ',
       '132 ', '137 ', '79 ', '156 ', '147 ', '54 ', '85 ', '15 ', '171 ',
       '59 ', '120 ', '88 ', '143 ', '133 ', '52 ', '83 ', '155 ', '121 ',
       '125 ', '146 ', '196 ', '78 ', '158 ', '69 ', '153 ', '145 ',
       '76 ', '84 ', '45 ', '179 ', '130 ', '64 ', '138 ', '175 ', '174 ',
       '144 ', '184 ', '150 ', '313 ', '164 ', '11 ', '148 ', '6 ', '71 ',
       '23 ', '157 ', '141 ', '358 ', '61 ', '192 ', '154 ', '166 ',
       '140 ', '57 ', '170 ', '205 ', '159 ', '136 ', '10 ', '58 ',
       '178 ', '240 ', '149 ', '180 ', '139 ', '294 ', '161 ', '72 ',
       '56 ', '183 ', '195 ', '131 ', '229 ', '5 ', '68 ', '290 '],
      dtype=object)

In [219]:
#type casting runtime to int
rt_movie_df['runtime_mins'] = rt_movie_df['runtime_mins'].map(int)
rt_movie_df.runtime_mins.unique()

array([104, 108, 116, 128,  95,  82, 123, 117,  90,  97, 106, 129,  98,
       127,  96, 101, 114, 110,  65,  75,  92,  91,  73, 100,  99, 103,
       112, 142, 119, 122,  86,  93, 111, 118,  89,  74, 115, 107, 165,
       113, 186,  67, 102,  60, 135, 109,  70, 124, 105, 134,  80,  87,
       167,  77,  81,  94, 188, 126,  63, 132, 137,  79, 156, 147,  54,
        85,  15, 171,  59, 120,  88, 143, 133,  52,  83, 155, 121, 125,
       146, 196,  78, 158,  69, 153, 145,  76,  84,  45, 179, 130,  64,
       138, 175, 174, 144, 184, 150, 313, 164,  11, 148,   6,  71,  23,
       157, 141, 358,  61, 192, 154, 166, 140,  57, 170, 205, 159, 136,
        10,  58, 178, 240, 149, 180, 139, 294, 161,  72,  56, 183, 195,
       131, 229,   5,  68, 290], dtype=int64)

In [220]:
rt_movie_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1495 entries, 0 to 1559
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1495 non-null   int64
 1   synopsis      1495 non-null   object
 2   rating        1495 non-null   object
 3   genre         1495 non-null   object
 4   director      1495 non-null   object
 5   writer        1495 non-null   object
 6   theater_date  1495 non-null   object
 7   dvd_date      1495 non-null   object
 8   runtime_mins  1495 non-null   int64
dtypes: int64(2), object(7)
memory usage: 116.8+ KB

The data set is now clean enough

# bom_movie_gross_df

In [331]:
bom_movie_gross_df = pd.read_csv('unzippedData/bom.movie_gross.csv')
#this is infomation about bom_movie_gross_df
bom_movie_gross_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [332]:
bom_movie_gross_df.head() # the first five rows

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [333]:
bom_movie_gross_df.title.unique()

array(['Toy Story 3', 'Alice in Wonderland (2010)',
       'Harry Potter and the Deathly Hallows Part 1', ..., 'El Pacto',
       'The Swan', 'An Actor Prepares'], dtype=object)

In [334]:
bom_movie_gross_df.describe() # descriptive statistics on the data

       domestic_gross         year
count    3.359000e+03  3387.000000
mean     2.874585e+07  2013.958075
std      6.698250e+07     2.478141
min      1.000000e+02  2010.000000
25%      1.200000e+05  2012.000000
50%      1.400000e+06  2014.000000
75%      2.790000e+07  2016.000000
max      9.367000e+08  2018.000000

In [114]:
print("There are 3387 rows with 5 columns in the 'bom_movie_gross' data set, the column names are {}".format(bom_movie_gross_df.columns))

There are 3387 rows with 5 columns in the 'bom_movie_gross' data set, the column names are Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

In [115]:
"""
There are three columns with missing values in 'bom_movie_gross', the columns are: studio, domestic_gross, foreign_gross
"""

"\nThere are three columns with missing values in 'bom_movie_gross', the columns are: studio, domestic_gross, foreign_gross\n"

In [335]:
bom_movie_gross_df.tail() # the last five rows of the data

,title,studio,domestic_gross,foreign_gross,year
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [336]:
bom_movie_gross_df.isna().sum() #this is the number of missing values in each column

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [337]:
#changing the data type of foreign gross from object to float
#bom_movie_gross_df['foreign_gross'] = bom_movie_gross_df['foreign_gross'].map()
bom_movie_gross_df['foreign_gross'].dtype

dtype('O')

In [338]:
bom_movie_gross_df.foreign_gross.unique()

array(['652000000', '691300000', '664300000', ..., '530000', '256000',
       '30000'], dtype=object)

In [339]:
bom_movie_gross_df['foreign_gross'] = bom_movie_gross_df['foreign_gross'].map(float)

ValueError: could not convert string to float: '1,131.6'

In [340]:
bom_movie_gross_df['foreign_gross'] = bom_movie_gross_df['foreign_gross'].str.replace(',.', '')
bom_movie_gross_df['foreign_gross'] = bom_movie_gross_df['foreign_gross'].map(float)

In [341]:
bom_movie_gross_df.foreign_gross.dtype #confirming that type has changed to float

dtype('float64')

In [342]:
bom_movie_gross_df.dropna(subset = ['studio'], axis = 0, inplace = True)
#.fillna(bom_movie_gross_df['domestic_gross'].mean(), inplace = True)
bom_movie_gross_df.fillna(bom_movie_gross_df['foreign_gross'].mean(), inplace = True)
#filling missing values of domestic gross with its mean

In [343]:
bom_movie_gross_df.duplicated().sum() # no duplicates in this data set

0

In [344]:
bom_movie_gross_df.fillna(bom_movie_gross_df['domestic_gross'].mean(), inplace = True)

In [345]:
bom_movie_gross_df.info() #now I have a cleaned data set

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3382 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3382 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3382 non-null   float64
 3   foreign_gross   3382 non-null   float64
 4   year            3382 non-null   int64
dtypes: float64(2), int64(1), object(2)
memory usage: 158.5+ KB

In [278]:
bom_movie_gross_df

,title,studio,domestic_gross_usd,foreign_gross_usd,year
0,Toy Story 3,BV,415000000.0,6.520000e+08,2010
1,Alice in Wonderland (2010),BV,334200000.0,6.913000e+08,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,6.643000e+08,2010
3,Inception,WB,292600000.0,5.357000e+08,2010
4,Shrek Forever After,P/DW,238700000.0,5.139000e+08,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,7.495490e+07,2018
3383,Edward II (2018 re-release),FM,4800.0,7.495490e+07,2018
3384,El Pacto,Sony,2500.0,7.495490e+07,2018
3385,The Swan,Synergetic,2400.0,7.495490e+07,2018
3386,An Actor Prepares,Grav.,1700.0,7.495490e+07,2018

In [346]:
bom_movie_gross_df.rename(columns = {'domestic_gross': 'domestic_gross_usd',
                                    'foreign_gross': 'foreign_gross_usd'}, inplace = True)
bom_movie_gross_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3382 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   title               3382 non-null   object
 1   studio              3382 non-null   object
 2   domestic_gross_usd  3382 non-null   float64
 3   foreign_gross_usd   3382 non-null   float64
 4   year                3382 non-null   int64
dtypes: float64(2), int64(1), object(2)
memory usage: 158.5+ KB

The data set is now clean enough

# rt_reviews_df

In [136]:
rt_reviews_df = pd.read_csv('unzippedData/rt.reviews.tsv', sep = '\t', encoding = 'latin1')
#this is information about tsv_reviews_df
rt_reviews_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54432 entries, 0 to 54431
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          54432 non-null  int64
 1   review      48869 non-null  object
 2   rating      40915 non-null  object
 3   fresh       54432 non-null  object
 4   critic      51710 non-null  object
 5   top_critic  54432 non-null  int64
 6   publisher   54123 non-null  object
 7   date        54432 non-null  object
dtypes: int64(2), object(6)
memory usage: 3.3+ MB

In [137]:
rt_reviews_df.describe()

                 id    top_critic
count  54432.000000  54432.000000
mean    1045.706882      0.240594
std      586.657046      0.427448
min        3.000000      0.000000
25%      542.000000      0.000000
50%     1083.000000      0.000000
75%     1541.000000      0.000000
max     2000.000000      1.000000

In [138]:
rt_reviews_df.head()

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

In [139]:
rt_reviews_df.tail()

,id,review,rating,fresh,critic,top_critic,publisher,date
54427,2000,The real charm of this trifle is the deadpan c...,NaN,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

In [140]:
rt_reviews_df.isna().sum()

id                0
review         5563
rating        13517
fresh             0
critic         2722
top_critic        0
publisher       309
date              0
dtype: int64

In [141]:
rt_reviews_df.rating.unique() # cannot cast the type of data from object to float, hence I will drop

array(['3/5', nan, 'C', '2/5', 'B-', '2/4', 'B', '3/4', '4/5', '4/4',
       '6/10', '1/4', '8', '2.5/4', '4/10', '2.0/5', '3/10', '7/10', 'A-',
       '5/5', 'F', '3.5/4', 'D+', '1.5/4', '3.5/5', '8/10', 'B+', '9/10',
       '2.5/5', '7.5/10', '5.5/10', 'C-', '1.5/5', '1/5', '5/10', 'C+',
       '0/5', '6', '0.5/4', 'D', '3.1/5', '3/6', '4.5/5', '0/4', '2/10',
       'D-', '7', '1/10', '3', 'A+', 'A', '4.0/4', '9.5/10', '2.5',
       '2.1/2', '6.5/10', '3.7/5', '8.4/10', '9', '1', '7.2/10', '2.2/5',
       '0.5/10', '5', '0', '2', '4.5', '7.7', '5.0/5', '8.5/10', '3.0/5',
       '0.5/5', '1.5/10', '3.0/4', '2.3/10', '4.5/10', '4/6', '3.5',
       '8.6/10', '6/8', '2.0/4', '2.7', '4.2/10', '5.8', '4', '7.1/10',
       '5/4', 'N', '3.5/10', '5.8/10', 'R', '4.0/5', '0/10', '5.0/10',
       '5.9/10', '2.4/5', '1.9/5', '4.9', '7.4/10', '1.5', '2.3/4',
       '8.8/10', '4.0/10', '2.2', '3.8/10', '6.8/10', '7.3', '7.0/10',
       '3.2', '4.2', '8.4', '5.5/5', '6.3/10', '7.6/10', '8.1/10',
       '3.6/5', '2/6', '7.7/10', '1.8', '8.9/10', '8.9', '8.2/10',
       '8.3/10', '2.6/6', '4.1/10', '2.5/10', 'F+', '6.0/10', '1.0/4',
       '7.9/10', '8.7/10', '4.3/10', '9.6/10', '9.0/10', '4.0', '1.7',
       '7.9', '6.7', '8.0/10', '9.2/10', '5.2', '5.9', '3.7', '4.7',
       '6.2/10', '1/6', '8.2', '2.6/5', '3.4', '9.7', '3.3/5', '3.8/5',
       '1/2', '7.4', '4.8', '1.6/5', '2/2', '1-5', '1.0', '4.3/5', '5/6',
       '9.2', '2.7/5', '4.9/10', '3.0', '3.1', '7.8/10', 'F-', '2.3/5',
       '3.0/10', '3/2', '7.8', '4.2/5', '9.0', '7.3/10', '4.4/5',
       '6.9/10', '0/6', 'T', '6.2', '3.3', '9.8', '8.5', '1.0/5', '4.1',
       '7.1', '3 1/2'], dtype=object)

In [142]:
#dropping missing values and difficult columns
rt_reviews_df.drop(['rating'], axis = 1, inplace = True)
rt_reviews_df.dropna(subset = ['review'], axis = 0, inplace = True)

In [143]:
#filling values of critic and publisher using their mode
rt_reviews_df.fillna(rt_reviews_df['critic'].mode()[0], inplace = True)

In [144]:
rt_reviews_df.duplicated().sum() # shows the total number of duplicates

2

In [145]:
#dropping the duplicated rows from the data set
rt_reviews_df.drop_duplicates(inplace = True)
rt_reviews_df.duplicated().sum()

0

In [146]:
rt_reviews_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48867 entries, 0 to 54427
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          48867 non-null  int64
 1   review      48867 non-null  object
 2   fresh       48867 non-null  object
 3   critic      48867 non-null  object
 4   top_critic  48867 non-null  int64
 5   publisher   48867 non-null  object
 6   date        48867 non-null  object
dtypes: int64(2), object(5)
memory usage: 3.0+ MB

The data is now clean enough

# sql data sets

In [62]:
import sqlite3
conn = sqlite3.connect('unzippedData/im.db')
cur = conn.cursor()
cur.execute("""
SELECT name
  FROM sqlite_master
 WHERE type = 'table'
""")
table_names = cur.fetchall()
table_names

[('movie_basics',),
 ('directors',),
 ('known_for',),
 ('movie_akas',),
 ('movie_ratings',),
 ('persons',),
 ('principals',),
 ('writers',)]

In [63]:
! ls

Data Understanding.ipynb
data.sqlite
Microsoft_movie_data_consideration.ipynb
README.md
unzippedData

In [64]:
%%script sqlite3 data.sqlite --out tables
.tables
.quit

# movie_basics_df

In [265]:
movie_basics_df = pd.read_sql("""
SELECT *
  FROM movie_basics;
""", conn)
movie_basics_df.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [266]:
movie_basics_df.tail()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho TeÃ³philo - O Legado de um Pioneiro,Rodolpho TeÃ³philo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - RevelaÃ§Ãµes,Chico Albuquerque - RevelaÃ§Ãµes,2013,NaN,Documentary

In [267]:
movie_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [268]:
movie_basics_df.describe()

          start_year  runtime_minutes
count  146144.000000    114405.000000
mean     2014.621798        86.187247
std         2.733583       166.360590
min      2010.000000         1.000000
25%      2012.000000        70.000000
50%      2015.000000        87.000000
75%      2017.000000        99.000000
max      2115.000000     51420.000000

In [269]:
movie_basics_df.primary_title.unique()

array(['Sunghursh', 'One Day Before the Rainy Season',
       'The Other Side of the Wind', ..., 'Dankyavar Danka', '6 Gunn',
       'Chico Albuquerque - RevelaÃ§Ãµes'], dtype=object)

In [270]:
movie_basics_df.isna().sum()#shows the total missing values by columns

movie_id               0
primary_title          0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64

In [271]:
movie_basics_df.drop(['original_title'], axis = 1, inplace = True)
movie_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 5 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   start_year       146144 non-null  int64
 3   runtime_minutes  114405 non-null  float64
 4   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(3)
memory usage: 5.6+ MB

In [272]:
movie_basics_df.dropna(subset = ['genres'], axis = 0, inplace = True)
movie_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 140736 entries, 0 to 146143
Data columns (total 5 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         140736 non-null  object
 1   primary_title    140736 non-null  object
 2   start_year       140736 non-null  int64
 3   runtime_minutes  112233 non-null  float64
 4   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(3)
memory usage: 6.4+ MB

In [273]:
movie_basics_df.dropna(subset = ['runtime_minutes'], axis = 0, inplace = True)
movie_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 112233 entries, 0 to 146139
Data columns (total 5 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         112233 non-null  object
 1   primary_title    112233 non-null  object
 2   start_year       112233 non-null  int64
 3   runtime_minutes  112233 non-null  float64
 4   genres           112233 non-null  object
dtypes: float64(1), int64(1), object(3)
memory usage: 5.1+ MB

In [80]:
movie_basics_df.duplicated().sum() #checking for duplicates

0

The data set 'movie_basics_df' has no duplicates and is now clean

# movie_ratings_df

In [84]:
movie_ratings_df = pd.read_sql("""
SELECT *
  FROM movie_ratings;
""",conn)
movie_ratings_df.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [85]:
movie_ratings_df.tail()

        movie_id  averagerating  numvotes
73851  tt9805820            8.1        25
73852  tt9844256            7.5        24
73853  tt9851050            4.7        14
73854  tt9886934            7.0         5
73855  tt9894098            6.3       128

In [82]:
movie_ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [83]:
movie_ratings_df.describe()

       averagerating      numvotes
count   73856.000000  7.385600e+04
mean        6.332729  3.523662e+03
std         1.474978  3.029402e+04
min         1.000000  5.000000e+00
25%         5.500000  1.400000e+01
50%         6.500000  4.900000e+01
75%         7.400000  2.820000e+02
max        10.000000  1.841066e+06

In [86]:
movie_ratings_df.isna().sum()#checking for missing values

movie_id         0
averagerating    0
numvotes         0
dtype: int64

In [102]:
movie_ratings_df.duplicated().sum() #checking for duplicates

0

The data set 'movie_ratings_df' has no missing values or duplicates, it is clean enough

# Movie_directors

In [348]:
movie_directors_df = pd.read_sql("""
SELECT primary_name, movie_id
  FROM persons
  LEFT JOIN directors
  USING(person_id);
""", conn)
movie_directors_df.head()

        primary_name movie_id
0  Mary Ellen Bauder     None
1       Joseph Bauer     None
2         Bruce Baum     None
3       Axel Baumann     None
4        Pete Baxter     None

The fact that there are only 5 directors,

# tmdb_movies_df

In [88]:
tmdb_movies_df = pd.read_csv('unzippedData/tmdb.movies.csv')

In [89]:
tmdb_movies_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

In [90]:
tmdb_movies_df.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [93]:
tmdb_movies_df.tail()

,genre_ids,original_language,movie,popularity,release_date,title,vote_average,vote_count
26512,"[27, 18]",en,Laboratory Conditions,0.6,2018-10-13,Laboratory Conditions,0.0,1
26513,"[18, 53]",en,_EXHIBIT_84xxx_,0.6,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,"[14, 28, 12]",en,The Last One,0.6,2018-10-01,The Last One,0.0,1
26515,"[10751, 12, 28]",en,Trailer Made,0.6,2018-06-22,Trailer Made,0.0,1
26516,"[53, 27]",en,The Church,0.6,2018-10-05,The Church,0.0,1

In [91]:
tmdb_movies_df.drop(tmdb_movies_df.columns[0], axis = 1, inplace = True)
tmdb_movies_df.rename(columns = {'original_title': 'movie'}, inplace = True)
change the column name in order to facilitate a merger betweeen 'tmdb_movies_df' and 'tn_movie_budgets'

In [94]:
tmdb_movies_df.describe()

         popularity  vote_average    vote_count
count  26517.000000  26517.000000  26517.000000
mean       3.130912      5.991281    194.224837
std        4.355229      1.852946    960.961095
min        0.600000      0.000000      1.000000
25%        0.600000      5.000000      2.000000
50%        1.374000      6.000000      5.000000
75%        3.694000      7.000000     28.000000
max       80.773000     10.000000  22186.000000

In [92]:
#tmdb_movies_df.drop(tmdb_movies_df.columns[1], axis = 1, inplace = True)
tmdb_movies_df
#droping the id column

,genre_ids,original_language,movie,popularity,release_date,title,vote_average,vote_count
0,"[12, 14, 10751]",en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,"[12, 28, 878]",en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,"[16, 35, 10751]",en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,"[28, 878, 12]",en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...
26512,"[27, 18]",en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,"[18, 53]",en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,"[14, 28, 12]",en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,"[10751, 12, 28]",en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,"[53, 27]",en,The Church,0.600,2018-10-05,The Church,0.0,1

In [274]:
tmdb_movies_df.isna().sum() #checking for missing values

genre_ids            0
original_language    0
movie                0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
dtype: int64

In [275]:
tmdb_movies_df.duplicated().sum() #checking for duplicates

0

In [276]:
#dropping duplicates
tmdb_movies_df.drop_duplicates(inplace = True)
tmdb_movies_df.duplicated().sum()

0

In [277]:
tmdb_movies_df.genre_ids.value_counts()
tmdb_movies_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 25497 entries, 0 to 26516
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   genre_ids          25497 non-null  object
 1   original_language  25497 non-null  object
 2   movie              25497 non-null  object
 3   popularity         25497 non-null  float64
 4   release_date       25497 non-null  object
 5   title              25497 non-null  object
 6   vote_average       25497 non-null  float64
 7   vote_count         25497 non-null  int64
dtypes: float64(2), int64(1), object(5)
memory usage: 1.8+ MB

The data set 'tmdb_movies_df' is now clean enough

# tn_movie_budgets_df

In [106]:
tn_movie_budgets_df = pd.read_csv('unzippedData/tn.movie_budgets.csv')
tn_movie_budgets_df.head() #the first five rows

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [108]:
tn_movie_budgets_df.tail() #the last five rows

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [107]:
tn_movie_budgets_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [156]:
#strip the dollar signs in order to prepare for replacement
tn_movie_budgets_df['domestic_gross'] = tn_movie_budgets_df['domestic_gross'].str.strip('$,')
tn_movie_budgets_df['production_budget'] = tn_movie_budgets_df['production_budget'].str.strip('$,')
tn_movie_budgets_df['worldwide_gross'] = tn_movie_budgets_df['worldwide_gross'].str.strip('$,')

In [158]:
#replace the punctuation to facilitate type casting into int
tn_movie_budgets_df['domestic_gross'] = tn_movie_budgets_df['domestic_gross'].str.replace(',', '')
tn_movie_budgets_df['production_budget'] = tn_movie_budgets_df['production_budget'].str.replace(',', '')
tn_movie_budgets_df['worldwide_gross'] = tn_movie_budgets_df['worldwide_gross'].str.replace(',', '')

In [159]:
#type casting to int
tn_movie_budgets_df['worldwide_gross'] = tn_movie_budgets_df['worldwide_gross'].map(int)
tn_movie_budgets_df['production_budget'] = tn_movie_budgets_df['production_budget'].map(int)
tn_movie_budgets_df['domestic_gross'] = tn_movie_budgets_df['domestic_gross'].map(int)

In [352]:
#renaming to capture the unit of currency
tn_movie_budgets_df.rename(columns = {'worldwide_gross':'worldwide_gross_usd',
                                     'production_budget': 'production_budget_usd',
                                     'domestic_gross': 'domestic_gross_usd',
                                     'movie':'title'}, inplace = True)

In [353]:
tn_movie_budgets_df.describe()

,id,production_budget_usd,domestic_gross_usd,worldwide_gross_usd
count,5782.000000,5.782000e+03,5.782000e+03,5.782000e+03
mean,50.372363,3.158776e+07,4.187333e+07,9.148746e+07
std,28.821076,4.181208e+07,6.824060e+07,1.747200e+08
min,1.000000,1.100000e+03,0.000000e+00,0.000000e+00
25%,25.000000,5.000000e+06,1.429534e+06,4.125415e+06
50%,50.000000,1.700000e+07,1.722594e+07,2.798445e+07
75%,75.000000,4.000000e+07,5.234866e+07,9.764584e+07
max,100.000000,4.250000e+08,9.366622e+08,2.776345e+09

In [354]:
tn_movie_budgets_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     5782 non-null   int64
 1   release_date           5782 non-null   object
 2   title                  5782 non-null   object
 3   production_budget_usd  5782 non-null   int64
 4   domestic_gross_usd     5782 non-null   int64
 5   worldwide_gross_usd    5782 non-null   int64
dtypes: int64(4), object(2)
memory usage: 271.2+ KB

In [39]:
print("The columns of tn_movies_budgets_df.info are : {} \
and there are no missing values in this dataframe".format(tn_movie_budgets_df.columns))

The columns of tn_movies_budgets_df.info are : Index(['id', 'release_date', 'movie', 'production_budget', 'domestic_gross',
       'worldwide_gross'],
      dtype='object') and there are no missing values in this dataframe

The data is now clean enough

# Combining data frames

# rt_movies_df with rt_reviews_df

In [279]:
rt_reviews_movies_df = rt_reviews_df.merge(rt_movie_df, on = 'id', how = 'left')
rt_reviews_movies_df

,id,review,fresh,critic,top_critic,publisher,date,synopsis,rating,genre,director,writer,theater_date,dvd_date,runtime_mins
0,3,A distinctly gallows take on contemporary fina...,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018","New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",108.0
1,3,It's an allegory in search of a meaning that n...,rotten,Annalee Newitz,0,io9.com,"May 23, 2018","New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",108.0
2,3,... life lived in a bubble in financial dealin...,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018","New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",108.0
3,3,Continuing along a line introduced in last yea...,fresh,Daniel Kasman,0,MUBI,"November 16, 2017","New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",108.0
4,3,... a perverse twist on neorealism...,fresh,Dennis Schwartz,0,Cinema Scope,"October 12, 2017","New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",108.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48862,2000,"Despite the title, Wasabi isn't so spicy.",rotten,Dennis Schwartz,0,E! Online,"September 27, 2002","Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,Steven Spielberg,Luc Besson,"Sep 27, 2001","Feb 11, 2003",94.0
48863,2000,Dawdles and drags when it should pop; it doesn...,rotten,Manohla Dargis,1,Los Angeles Times,"September 26, 2002","Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,Steven Spielberg,Luc Besson,"Sep 27, 2001","Feb 11, 2003",94.0
48864,2000,Despite Besson's high-profile name being Wasab...,fresh,Andy Klein,0,New Times,"September 26, 2002","Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,Steven Spielberg,Luc Besson,"Sep 27, 2001","Feb 11, 2003",94.0
48865,2000,The film lapses too often into sugary sentimen...,rotten,Paul Malcolm,1,L.A. Weekly,"September 26, 2002","Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,Steven Spielberg,Luc Besson,"Sep 27, 2001","Feb 11, 2003",94.0
48866,2000,The real charm of this trifle is the deadpan c...,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002","Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,Steven Spielberg,Luc Besson,"Sep 27, 2001","Feb 11, 2003",94.0

In [280]:
rt_reviews_movies_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48867 entries, 0 to 48866
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            48867 non-null  int64
 1   review        48867 non-null  object
 2   fresh         48867 non-null  object
 3   critic        48867 non-null  object
 4   top_critic    48867 non-null  int64
 5   publisher     48867 non-null  object
 6   date          48867 non-null  object
 7   synopsis      48753 non-null  object
 8   rating        48753 non-null  object
 9   genre         48753 non-null  object
 10  director      48753 non-null  object
 11  writer        48753 non-null  object
 12  theater_date  48753 non-null  object
 13  dvd_date      48753 non-null  object
 14  runtime_mins  48753 non-null  float64
dtypes: float64(1), int64(2), object(12)
memory usage: 6.0+ MB

In [224]:
rt_reviews_movies_df.isna().sum() #checking for missing values

id                0
review            0
fresh             0
critic            0
top_critic        0
publisher         0
date              0
synopsis        114
rating          114
genre           114
director        114
writer          114
theater_date    114
dvd_date        114
runtime_mins    114
dtype: int64

In [281]:
#removing rows with missing values
rt_reviews_movies_df.dropna(subset = ['synopsis', 'rating', 'genre', 'director',
                                   'writer', 'theater_date', 'dvd_date','runtime_mins'],
                        axis = 0, inplace = True)

In [282]:
rt_reviews_movies_df.duplicated().sum() #checking for duplicates

0

In [283]:
rt_reviews_movies_df.info()#there are now missing values

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48753 entries, 0 to 48866
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            48753 non-null  int64
 1   review        48753 non-null  object
 2   fresh         48753 non-null  object
 3   critic        48753 non-null  object
 4   top_critic    48753 non-null  int64
 5   publisher     48753 non-null  object
 6   date          48753 non-null  object
 7   synopsis      48753 non-null  object
 8   rating        48753 non-null  object
 9   genre         48753 non-null  object
 10  director      48753 non-null  object
 11  writer        48753 non-null  object
 12  theater_date  48753 non-null  object
 13  dvd_date      48753 non-null  object
 14  runtime_mins  48753 non-null  float64
dtypes: float64(1), int64(2), object(12)
memory usage: 6.0+ MB

In [231]:
rt_reviews_movies_df.duplicated().sum()

0

This data set has no missing values and is now clean enough

# tn_movie_and_budgets_df

In [284]:
tn_movie_and_budgets_df = tmdb_movies_df.merge(tn_movie_budgets_df, on = 'movie', 
                                               how = 'inner')
tn_movie_and_budgets_df.head()

,genre_ids,original_language,movie,popularity,release_date_x,title,vote_average,vote_count,id,release_date_y,production_budget_usd,domestic_gross_usd,worldwide_gross_usd
0,"[14, 12, 16, 10751]",en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610,30,"Mar 26, 2010",165000000,217581232,494870992
1,"[12, 28, 878]",en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368,15,"May 7, 2010",170000000,312433331,621156389
2,"[16, 35, 10751]",en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174,37,"Nov 22, 1995",30000000,191796233,364545516
3,"[28, 878, 12]",en,Inception,27.920,2010-07-16,Inception,8.3,22186,38,"Jul 16, 2010",160000000,292576195,835524642
4,"[12, 14, 10751]",en,Percy Jackson & the Olympians: The Lightning T...,26.691,2010-02-11,Percy Jackson & the Olympians: The Lightning T...,6.1,4229,17,"Feb 12, 2010",95000000,88768303,223050874

In [255]:
tn_movie_and_budgets_df.tail()

,genre_ids,original_language,movie,popularity,release_date_x,title,vote_average,vote_count,id,release_date_y,production_budget_usd,domestic_gross_usd,worldwide_gross_usd
2139,[],en,The Box,0.600,2018-03-04,The Box,8.0,1,66,"Nov 6, 2009",25000000,15051977,34356760
2140,[10402],en,The Box,0.600,2018-03-04,The Box,6.0,1,66,"Nov 6, 2009",25000000,15051977,34356760
2141,"[35, 16]",en,Enough,0.719,2018-03-22,Enough,8.7,3,68,"May 24, 2002",38000000,39177215,50970660
2142,[],en,Undiscovered,0.600,2018-04-07,Undiscovered,8.0,1,7,"Aug 26, 2005",9000000,1069318,1069318
2143,[16],en,Jaws,0.600,2018-05-29,Jaws,0.0,1,41,"Jun 20, 1975",12000000,260000000,470700000

In [264]:
tn_movie_and_budgets_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2144 entries, 0 to 2143
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   genre_ids              2144 non-null   object
 1   original_language      2144 non-null   object
 2   movie                  2144 non-null   object
 3   popularity             2144 non-null   float64
 4   release_date_x         2144 non-null   object
 5   title                  2144 non-null   object
 6   vote_average           2144 non-null   float64
 7   vote_count             2144 non-null   int64
 8   id                     2144 non-null   int64
 9   release_date_y         2144 non-null   object
 10  production_budget_usd  2144 non-null   int64
 11  domestic_gross_usd     2144 non-null   int64
 12  worldwide_gross_usd    2144 non-null   int64
dtypes: float64(2), int64(5), object(6)
memory usage: 234.5+ KB

In [263]:
tn_movie_and_budgets_df.duplicated().sum()

0

In [262]:
tn_movie_and_budgets_df.describe()

,popularity,vote_average,vote_count,id,production_budget_usd,domestic_gross_usd,worldwide_gross_usd
count,2144.000000,2144.000000,2144.000000,2144.000000,2.144000e+03,2.144000e+03,2.144000e+03
mean,10.494432,6.162547,1633.102146,50.798041,3.762562e+07,4.881685e+07,1.183783e+08
std,8.268091,1.191407,2652.658666,28.371655,5.132136e+07,8.209616e+07,2.219392e+08
min,0.600000,0.000000,1.000000,1.000000,9.000000e+03,0.000000e+00,0.000000e+00
25%,5.110500,5.600000,52.000000,27.000000,5.000000e+06,6.399670e+05,2.760056e+06
50%,9.391000,6.200000,583.000000,51.000000,1.800000e+07,2.015790e+07,3.668101e+07
75%,14.179750,6.900000,2006.000000,75.000000,4.600000e+07,5.801501e+07,1.193840e+08
max,80.773000,10.000000,22186.000000,100.000000,4.250000e+08,7.605076e+08,2.776345e+09

In [261]:
tn_movie_and_budgets_df.isna().sum()#finding the number of missing values

genre_ids                0
original_language        0
movie                    0
popularity               0
release_date_x           0
title                    0
vote_average             0
vote_count               0
id                       0
release_date_y           0
production_budget_usd    0
domestic_gross_usd       0
worldwide_gross_usd      0
dtype: int64

In [260]:
tn_movie_and_budgets_df.duplicated().sum() # this gives the sum of the duplicates in this data set.

0

In [327]:
#removing unnecessary columns from the data sets:release_date_y, original language and movie
tn_movie_and_budgets_df.drop(['movie'], axis=1, inplace = True)
tn_movie_and_budgets_df.info()

KeyError: "['movie'] not found in axis"

In [328]:
tn_movie_and_budgets_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2144 entries, 0 to 2143
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   genre_ids              2144 non-null   object
 1   popularity             2144 non-null   float64
 2   release_date_x         2144 non-null   object
 3   title                  2144 non-null   object
 4   vote_average           2144 non-null   float64
 5   vote_count             2144 non-null   int64
 6   id                     2144 non-null   int64
 7   production_budget_usd  2144 non-null   int64
 8   domestic_gross_usd     2144 non-null   int64
 9   worldwide_gross_usd    2144 non-null   int64
dtypes: float64(2), int64(5), object(3)
memory usage: 184.2+ KB

The data set is now clean enough

In [290]:
# for motivation, simple is better than complex
import this

# movie_basics_and_ratings_df

In [322]:
movie_basics_and_ratings_df = movie_basics_df.merge(movie_ratings_df,
                                                    on ='movie_id', how = 'inner')
movie_basics_and_ratings_df.head()

,movie_id,primary_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,2019,114.0,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,2018,122.0,Drama,6.9,4517
3,tt0100275,The Wandering Soap Opera,2017,80.0,"Comedy,Drama,Fantasy",6.5,119
4,tt0137204,Joe Finds Grace,2017,83.0,"Adventure,Animation,Comedy",8.1,263

In [323]:
movie_basics_and_ratings_df.isna().sum()

movie_id           0
primary_title      0
start_year         0
runtime_minutes    0
genres             0
averagerating      0
numvotes           0
dtype: int64

In [324]:
movie_basics_and_ratings_df.rename(columns = {'primary_title':'title'}, inplace = True)
#changing the column name to facilitate a merger
movie_basics_and_ratings_df.head()

,movie_id,title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,2019,114.0,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,2018,122.0,Drama,6.9,4517
3,tt0100275,The Wandering Soap Opera,2017,80.0,"Comedy,Drama,Fantasy",6.5,119
4,tt0137204,Joe Finds Grace,2017,83.0,"Adventure,Animation,Comedy",8.1,263

In [325]:
movie_basics_and_ratings_df.tail()

,movie_id,title,start_year,runtime_minutes,genres,averagerating,numvotes
65715,tt9911774,Padmavyuhathile Abhimanyu,2019,130.0,Drama,8.4,365
65716,tt9913056,Swarm Season,2019,86.0,Documentary,6.2,5
65717,tt9913084,Diabolik sono io,2019,75.0,Documentary,6.2,6
65718,tt9914286,Sokagin Ã‡ocuklari,2019,98.0,"Drama,Family",8.7,136
65719,tt9916160,DrÃ¸mmeland,2019,72.0,Documentary,6.5,11

In [326]:
movie_basics_and_ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 65720 entries, 0 to 65719
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_id         65720 non-null  object
 1   title            65720 non-null  object
 2   start_year       65720 non-null  int64
 3   runtime_minutes  65720 non-null  float64
 4   genres           65720 non-null  object
 5   averagerating    65720 non-null  float64
 6   numvotes         65720 non-null  int64
dtypes: float64(2), int64(2), object(3)
memory usage: 4.0+ MB

In [355]:
movie_basics_ratings_revenue_df = movie_basics_and_ratings_df.merge(tn_movie_budgets_df,
                                                                    on = 'title', how = 'inner')
movie_basics_ratings_revenue_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2752 entries, 0 to 2751
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   movie_id               2752 non-null   object
 1   title                  2752 non-null   object
 2   start_year             2752 non-null   int64
 3   runtime_minutes        2752 non-null   float64
 4   genres                 2752 non-null   object
 5   averagerating          2752 non-null   float64
 6   numvotes               2752 non-null   int64
 7   id                     2752 non-null   int64
 8   release_date           2752 non-null   object
 9   production_budget_usd  2752 non-null   int64
 10  domestic_gross_usd     2752 non-null   int64
 11  worldwide_gross_usd    2752 non-null   int64
dtypes: float64(2), int64(6), object(4)
memory usage: 279.5+ KB

In [356]:
movie_basics_ratings_revenue_df

,movie_id,title,start_year,runtime_minutes,genres,averagerating,numvotes,id,release_date,production_budget_usd,domestic_gross_usd,worldwide_gross_usd
0,tt0249516,Foodfight!,2012,91.0,"Action,Animation,Comedy",1.9,8248,26,"Dec 31, 2012",45000000,0,73706
1,tt0337692,On the Road,2012,124.0,"Adventure,Drama,Romance",6.1,37886,17,"Mar 22, 2013",25000000,720828,9313302
2,tt4339118,On the Road,2014,89.0,Drama,6.0,6,17,"Mar 22, 2013",25000000,720828,9313302
3,tt5647250,On the Road,2016,121.0,Drama,5.7,127,17,"Mar 22, 2013",25000000,720828,9313302
4,tt0359950,The Secret Life of Walter Mitty,2013,114.0,"Adventure,Comedy,Drama",7.3,275300,37,"Dec 25, 2013",91000000,58236838,187861183
...,...,...,...,...,...,...,...,...,...,...,...,...
2747,tt8976472,Never Again,2018,69.0,"Documentary,Music",6.6,27,47,"Jul 12, 2002",500000,307631,308793
2748,tt8824064,Heroes,2019,88.0,Documentary,7.3,7,12,"Oct 24, 2008",400000,655538,655538
2749,tt8941440,Virus,2019,152.0,"Drama,Thriller",8.6,372,69,"Jan 15, 1999",75000000,14010690,30626690
2750,tt8976772,Push,2019,92.0,Documentary,7.3,33,70,"Feb 6, 2009",38000000,31811527,49678401
2751,tt9024106,Unplanned,2019,106.0,"Biography,Drama",6.3,5945,33,"Mar 29, 2019",6000000,18107621,18107621